// ===================================== Start =========================================

// Задача 1:
// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3


// Console.Write("Введите число a = ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число b = ");
// int b = Convert.ToInt32(Console.ReadLine());
// if (a > b)
// {
//     Console.WriteLine($"max = {a}");
// }
// if (a == b)
// {
//     Console.WriteLine($"{a} равно {b}");
// }
// if (b > a)
// {
//     Console.WriteLine($"max = {b}");
// }

// ========================================== END ==================================================

// ===================================== Start =========================================

// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.Write("Введите число: ");
// int numA = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число: ");
// int numB = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число: ");
// int numC = Convert.ToInt32(Console.ReadLine());
// if (numA > numB && numA > numC)
// {
//     Console.WriteLine($"max = {numA}");
// }
// if (numB > numC && numB > numC)
// {
//     Console.WriteLine($"max = {numB}");
// }
// if (numC > numA && numC > numB)
// {
//     Console.WriteLine($"max = {numC}");
// }

// ========================================== END ==================================================

// ===================================== Start =========================================

// Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// if (a % 2 == 0)
// {
//     Console.WriteLine("да");
// }
// else
// {
//     Console.WriteLine("нет");
// }

// ========================================== END ==================================================


// ===================================== Start =========================================

// Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
int cout = 1;
while (cout <= num)
{
    if (cout % 2 == 0)
    {
        Console.WriteLine(cout);
    }
    cout++;
}

// ========================================== END ==================================================